---
kind: method
id: M:Autodesk.Revit.DB.OBJExportOptions.IsValidForNormalTolerance(System.Double)
source: html/6b4aa9ab-b973-1e3b-20ef-44fc641476d0.htm
---
# Autodesk.Revit.DB.OBJExportOptions.IsValidForNormalTolerance Method

Checks whether the value is allowed (is in the allowed range) for NormalTolerance tessellation parameter.

## Syntax (C#)
```csharp
public static bool IsValidForNormalTolerance(
	double value
)
```

## Parameters
- **value** (`System.Double`) - The value to be checked.

## Returns
True if the value is valid for NormalTolerance, false otherwise.